BUILD/doc/source/_static/soap_outputs/6.5.314.4301/deploy_action_with_params_against_windows_computers_step_5_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <saved_actions>
          <saved_action>
            <comment>Created by PyTan v2.1.4</comment>
            <status>0</status>
            <expire_seconds>660</expire_seconds>
            <name>API Deploy Custom Tagging - Add Tags</name>
            <distribute_seconds>0</distribute_seconds>
            <start_time></start_time>
            <public_flag>0</public_flag>
            <issue_count>0</issue_count>
            <policy_flag>0</policy_flag>
            <end_time></end_time>
            <issue_seconds>0</issue_seconds>
            <approved_flag>0</approved_flag>
            <id>-1</id>
            <target_group>
              <filters>
                <filter>
                  <not_flag>0</not_flag>
                  <value>.*Windows.*</value>
                  <operator>RegexMatch</operator>
                  <sensor>
                    <hash>45421433</hash>
                  </sensor>
                </filter>
              </filters>
            </target_group>
            <package_spec>
              <expire_seconds>660</expire_seconds>
              <display_name>Custom Tagging - Add Tags</display_name>
              <name>Custom Tagging - Add Tags</name>
              <verify_expire_seconds>600</verify_expire_seconds>
              <verify_group_id>0</verify_group_id>
              <skip_lock_flag>0</skip_lock_flag>
              <last_update>2015-09-14T13:39:15</last_update>
              <source_id>33</source_id>
              <hidden_flag>1</hidden_flag>
              <command>cmd /c cscript //T:60 add-tags.vbs "$1"</command>
              <command_timeout>60</command_timeout>
              <parameter_definition>{"parameters":[{"label":"Add tags (space-delimited)","helpString":"Enter tags space-delimited.","defaultValue":"","promptText":"e.g. PCI DMZ Decomm","maxChars":0,"key":"$1","restrict":null,"validationExpressions":[{"helpString":"You must enter a value","expression":"\\S","flags":"","parameterType":"com.tanium.models::ValidationExpression","model":"com.tanium.models::ValidationExpression"}],"value":"","parameterType":"com.tanium.components.parameters::TextInputParameter","model":"com.tanium.components.parameters::TextInputParameter"}],"parameterType":"com.tanium.components.parameters::ParametersArray","model":"com.tanium.components.parameters::ParametersArray"}</parameter_definition>
              <parameters>
                <parameter>
                  <value>tag_should_be_added</value>
                  <key>$1</key>
                </parameter>
                <parameter>
                  <value>tag_should_be_ignore</value>
                  <key>$2</key>
                </parameter>
              </parameters>
              <verify_group>
                <id>0</id>
              </verify_group>
              <metadata>
                <item>
                  <admin_flag>0</admin_flag>
                  <name>defined</name>
                  <value>Tanium</value>
                </item>
                <item>
                  <admin_flag>0</admin_flag>
                  <name>category</name>
                  <value>Tanium</value>
                </item>
              </metadata>
            </package_spec>
          </saved_action>
        </saved_actions>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>